In [1]:
from sqlalchemy import create_engine
import os

In [2]:
path_root = os.path.abspath("/Users/user/PY_workshop/ex3_db")

In [3]:
path_root

'/Users/user/PY_workshop/ex3_db'

In [4]:
path_db = os.path.join(path_root,"", "chinook.db")

In [5]:
path_db

'/Users/user/PY_workshop/ex3_db/chinook.db'

In [6]:
engine = create_engine(f'sqlite:///{path_db}')

In [7]:
sql = "select count(*) from invoice_items"

In [8]:
results = engine.execute(sql)

In [9]:
results.fetchall()

[(2240,)]

In [10]:
import pandas

In [31]:
sql = 'SELECT name from sqlite_master where type= "table"'

In [21]:
df = pandas.read_sql(sql, con=engine)

In [35]:
df

               name
0            albums
1   sqlite_sequence
2           artists
3         customers
4         employees
5            genres
6          invoices
7     invoice_items
8       media_types
9         playlists
10   playlist_track
11           tracks
12     sqlite_stat1

In [49]:
sql = "select Total from invoices where CustomerId=2"

In [50]:
df = pandas.read_sql(sql, con=engine)

In [51]:
df.head(100)

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,1,2,2009-01-01 00:00:00,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,1.98
1,12,2,2009-02-11 00:00:00,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,13.86
2,67,2,2009-10-12 00:00:00,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,8.91
3,196,2,2011-05-19 00:00:00,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,1.98
4,219,2,2011-08-21 00:00:00,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,3.96
5,241,2,2011-11-23 00:00:00,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,5.94
6,293,2,2012-07-13 00:00:00,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,0.99

In [57]:
sql = "select customers.LastName,invoices.Total from invoices INNER JOIN customers ON invoices.CustomerId=customers.CustomerId"

In [58]:
df = pandas.read_sql(sql, con=engine)

In [59]:
df

       LastName  Total
0     Gonçalves   3.98
1     Gonçalves   3.96
2     Gonçalves   5.94
3     Gonçalves   0.99
4     Gonçalves   1.98
..          ...    ...
407  Srivastava   5.94
408  Srivastava   1.99
409  Srivastava   1.98
410  Srivastava  13.86
411  Srivastava   8.91

[412 rows x 2 columns]

In [34]:
from platform import python_version

print(python_version())

3.7.6